generate_Data/generate_data_3d/flow_over_array_of_cylinders/isothermal/k_epsilon/sim_orig/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

#include        "include/initialConditions"

internalField   uniform $turbulentEpsilon;

boundaryField
{
    bot
    {
        type            epsilonWallFunction;
        value           uniform $turbulentEpsilon;
    }

    top
    {
        type            epsilonWallFunction;
        value           uniform $turbulentEpsilon;
    }

    front
    {
        type            epsilonWallFunction;
        value           uniform $turbulentEpsilon;

    }

    back
    {
        type            epsilonWallFunction;
        value           uniform $turbulentEpsilon;
    }

    cylinder
    {
        type            epsilonWallFunction;
        value           uniform $turbulentEpsilon;
    }

    inlet
    {
        type            fixedValue;
        value           uniform $turbulentEpsilon;
    }
    outlet
    {
        type            zeroGradient;
    }

}


// ************************************************************************* //
